Repository: 84000/data-translation-memory
Catalog: toh118-v3.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་འོ་ན་ཁྱོད་འདས་པའི་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་དེ་ལ་ཁྱོད་ཇི་ལྟར་མོས། གསོལ་པ།
en: “Well then, Mañjuśrī,” said the Blessed One, “how can you have conviction in the statement that the thus-gone ones of the past, equal in number to the grains of sand in the River Ganges, have passed into parinirvāṇa?”

source: གལ་ཏེ་དེ་དག་གི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན་ནི་བདག་མོས་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “If I had beheld their birth, I would have conviction.”

source: ཁྱོད་སོ་སོའི་སྐྱེ་བོ་ཤི་བ་རྣམས་ཉིད་མཚམས་སྦྱོར་བར་འདོད་དམ། གསོལ་པ།
en: “Do you maintain that ordinary beings are reborn after they die?”

source: བཅོམ་ལྡན་འདས་སོ་སོའི་སྐྱེ་བོ་ཉིད་ཀྱང་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་མི་དམིགས་ན་དེའི་ཉིང་མཚམས་སྦྱོར་བ་ལྟ་ག་ལ་དམིགས་ལགས། བཀའ་སྩལ་པ།
en: “Blessed One, since I do not see or apprehend ordinary beings, how could I possibly apprehend their rebirth?”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ཆོས་གནས་པར་བཞེད་ཀྱིས་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །གསོལ་པ།
en: “Mañjuśrī, please expound on the Thus-Gone One’s assertion that phenomena abide.”

source: ཅི་ཞིག་ལས་བརྩམས་ཏེ་སྤོབས་པར་བགྱི་ལགས། བཀའ་སྩལ་པ།
en: “Where should I begin my discourse?”

source: ཆོས་ཀྱི་དབྱིངས་ལས་རྩོམས་ཤིག །གསོལ་པ།
en: “Start with the realm of phenomena.”

source: བཅོམ་ལྡན་འདས་གང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས་པའི་ཆོས་དེ་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “Blessed One, I do not actually see any phenomena that are not the realm of phenomena.”

source: འཇམ་དཔལ་མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་སྐྲག་པར་འགྱུར་རོ། །གསོལ་པ།
en: “Mañjuśrī, those who are presumptuously arrogant will be frightened.”

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཡང་དག་པའི་མཐའ་སྐྲག་པར་འགྱུར་ན་ནི་དེའི་སླད་དུ་མངོན་པའི་ང་རྒྱལ་ཅན་ཡང་སྐྲག་པར་འགྱུར་ལགས་སོ།
en: “Blessed One, if the limit of reality were to be frightened, then, based on that, those who are presumptuously arrogant would also be frightened.

source: བཅོམ་ལྡན་འདས་ཡང་དག་པའི་མཐའ་ཡང་གཞན་ལ་མངོན་པའི་ང་རྒྱལ་ཅན་ཡང་གཞན་པ་ནི་མ་ལགས་ཀྱི།
en: Blessed One, those who are presumptuously arrogant are not something other than the limit of reality.

source: མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ཀྱི་མཐའ་གང་ལགས་པའི་མཐའ་དེ་ཉིད་ཡང་དག་པའི་མཐའ་ལགས་ལ།
en: Whatever is the limit of those who are presumptuously arrogant, that very limit is the limit of reality.

source: ཡང་དག་པའི་མཐའ་གང་ལགས་པ་དེ་ཡང་ཆོས་ཐམས་ཅད་ཀྱི་མཐའ་ལགས་ཏེ།
en: Moreover, that which is the limit of reality is also the limit of all phenomena.

source: དེའི་སླད་དུ་མི་སྐྲག་ལགས་སོ།
en: For that reason, they are not frightened.

source: །ཆོས་ཐམས་ཅད་ཡང་དག་པར་མ་བསྒྲུབས་པ་ཞེས་བགྱི་བ་འདི་ནི་རྡོ་རྗེའི་གཞི་ལགས་སོ།
en: The statement ‘no phenomenon is truly established’ is a vajra basis.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཅིའི་ཕྱིར་ན་འདི་རྡོ་རྗེའི་གཞི་ཞེས་བྱ། གསོལ་པ།
en: “Mañjuśrī,” asked the Blessed One, “Why is this called a vajra basis

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མི་ཕྱེད་པ་ལགས་ཏེ།
en: “Blessed One, all phenomena are indestructible.

source: དེའི་སླད་དུ་འདི་རྡོ་རྗེའི་གཞི་ལགས་སོ།
en: It is for this reason that it is called a vajra basis

source: །དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་སླད་དུ་ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ནི་རྡོ་རྗེའི་གཞི་ལགས་ཏེ།
en: Since the thus-gone ones are inconceivable, all phenomena are inconceivable. This is a vajra basis.

source: ཅིའི་སླད་དུ་རྡོ་རྗེའི་གཞི་ཞེས་བགྱི་ཞེ་ན།
en: Why is this referred to as a vajra basis

source: ཆོས་ཐམས་ཅད་སེམས་མ་མཆིས་པའི་སླད་དུ་ལགས་སོ།
en: It is because all phenomena are not mind.

source: །ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཅེས་བགྱི་བ་འདི་ནི་རྡོ་རྗེའི་གཞི་ལགས་ཏེ།
en: To say that all phenomena are awakening is a vajra basis.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this?

source: ཆོས་ཐམས་ཅད་བརྗོད་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ།
en: Because all phenomena are inexpressible.

source: འདི་ན་མིང་གང་དང་གང་གིས་ཆོས་གང་དང་གང་བརྗོད་པའི་ཆོས་དེ་དང་དེ་ཆོས་དེ་དང་དེ་ལ་མ་མཆིས་ལགས་སོ།
en: Phenomena expressed by means of various names are not actually present in those very phenomena.

source: །གང་མ་མཆིས་པ་དེ་ནི་སྟོང་པ་ལགས་སོ།
en: Whatever is not present is empty.

source: །གང་སྟོང་པ་དེ་ནི་མེད་པ་ལགས་སོ།
en: That which is empty does not exist.

source: །གང་མེད་པ་དེ་ནི་བརྗོད་པའི་རྔོ་མི་ཐོགས་པ་ལགས་སོ།
en: What does not exist cannot be expressed.

source: །བརྗོད་དུ་མ་མཆིས་པ་དེ་ནི་བྱང་ཆུབ་ལགས་ཏེ།
en: The inexpressible is awakening.

source: དེའི་སླད་དུ། འདི་ནི་རྡོ་རྗེའི་གཞི་ལགས་སོ།
en: It is for that reason that this is a vajra basis.

source: །ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལགས་ཏེ།
en: All phenomena are the object of the thus-gone ones.

source: འདི་ནི་རྡོ་རྗེའི་གཞི་ལགས་སོ། །བཀའ་སྩལ་པ།
en: This is a vajra basis.”

source: ཅིའི་ཕྱིར་རྡོ་རྗེའི་གཞི་ཞེས་བྱ། གསོལ་པ།
en: “Why is it called a vajra basis

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་རང་གི་ཡུལ་ལས་དབེན་པ་ལགས་ཏེ།
en: “Blessed One, all phenomena are devoid of their own objects.

source: དེའི་སླད་དུ་འདི་རྡོ་རྗེའི་གཞི་ལགས་སོ། །བཀའ་སྩལ་པ།
en: For that reason, this is a vajra basis.”

source: འཇམ་དཔལ་དགེ་སློང་ཀུན་དགའ་བོ་དེ་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་འཛིན་པར་འགྱུར་ན།
en: “Mañjuśrī, the monk Ānanda will also comprehend this Dharma exposition.

source: འདིར་འོངས་པའི་མཚན་མ་ངས་བྱའམ། གསོལ་པ།
en: Shall I motion him to come here?”

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་བརྗོད་པའམ། བསྟན་པ་མཆིས་ལགས་སམ།
en: “Blessed One, is there any Dharma that has been taught or expressed here?

source: བདག་གིས་ནི་ཡི་གེ་གཅིག་ཀྱང་བསྟན་པར་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ལགས་ན།
en: I myself have not actually witnessed even a single syllable that has been taught.

source: མང་པོ་ལྟ་ག་ལ་མཐོང་ལགས། བཀའ་སྩལ་པ།
en: That being so, how could I possibly have perceived many of them?”

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །འཇམ་དཔལ་ཁྱོད་འདི་སྐད་དུ་འཆད་པ་ནི་ཁྱོད་ཀྱི་ཚིག་འདི་ལེགས་པར་སྨྲས་པ་ཡིན་ཏེ།
en: “Excellent, Mañjuśrī, excellent. These words of yours, which you present in this way, are well spoken.

source: འཇམ་དཔལ་ཁྱོད་ལེགས་སོ།
en: Well done, Mañjuśrī.

source: །འཇམ་དཔལ་ངས་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཆོས་ཉིད་འདི་ཁོ་ན་སྟོན་ཅིང་བཞུགས་པ་དག་མཐོང་ངོ་།
en: In the countless, innumerable world systems of the ten directions, I see thus-gone ones, worthy ones, perfect buddhas abiding and teaching this reality.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་རང་གི་གནས་ཁང་ནས་བྱུང་ནས།
en: At this point Venerable Śāriputra left his dwelling and went to the dwelling of Youthful Mañjuśrī.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་གནས་ཁང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མ་མཐོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་བཞུགས་ཁང་ག་ལ་བ་དེར་སོང་ནས།
en: He did not see Mañjuśrī there, and so he went to the Blessed One’s dwelling.

source: བཞུགས་ཁང་གི་ཕྱི་སྒོ་ན་འགྲེང་བ་དང་། གསུང་བའི་གསུང་ཐོས་སོ།
en: He stood outside the door and heard the teachings being given.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་གནས་ཁང་གི་ཕྱི་སྒོ་ན་འགྲེང་སྟེ།
en: The Blessed One said to Youthful Mañjuśrī, “Mañjuśrī, the monk Śāriputra is standing outside the door of this dwelling.

source: ཆོས་ཉན་པར་འདོད་ན་འཇམ་དཔལ་ཤཱ་རིའི་བུ་ཆོས་ཉན་པར་ནང་དུ་འོང་བར་གྱིས་ཤིག །གསོལ་པ།
en: As he wishes to listen to the Dharma, Mañjuśrī, bring Śāriputra inside so he can listen.”

source: མཐའ་འདི་ནི་ཡང་དག་པའི་མཐའ་ལགས་ན། གང་གི་སླད་རོལ་དང་། ནང་དང་གཉིས་ཀ་མ་མཆིས་པར་གདའ་ལགས་སམ། བཀའ་སྩལ་པ།
en: “If this limit is the limit of reality, is it present outside, inside, or neither?”

source: འཇམ་དཔལ་དེ་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: “Mañjuśrī, it is none of these.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་ཡང་དག་པའི་མཐའ་ནི་མཐའ་མ་མཆིས་པ་ལགས་ཏེ།
en: “Therefore, Blessed One, the limit of reality is not a limit.

source: དེ་ལྟ་བུའི་མཐའ་གང་ལགས་པ་དེ་ལ་ནི་ཚུར་མཆི་བའམ། ཕར་མཆི་བ་མ་མཆིས་ཏེ།
en: Regarding a limit such as this, one does not come here or go there.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བུའི་མཐའ་ཅན་གྱི་བཙུན་པ་ཤཱ་རིའི་བུ་དེ་ནི་ཚུར་མཆི་བའམ། ནང་དུ་མཆི་བའི་མི་རིགས་ལགས་སོ། །བཀའ་སྩལ་པ།
en: Thus, Blessed One, it is not appropriate for the honorable Śāriputra, who is limited in this way, to come here or come inside.”

source: འཇམ་དཔལ་གལ་ཏེ་ང་གནས་ཁང་གི་ནང་ན་ཉན་ཐོས་དག་དང་ལྷན་ཅིག་ཏུ་གཏམ་ཟེར་ཞིང་འདུག་ལ། ཁྱོད་ནི་ཕྱི་རོལ་ན་འདུག་སྟེ། ནང་དུ་འོང་དུ་ཡང་མི་དབང་ན་ཅི་ཁྱོད་སྡུག་བསྔལ་བར་མི་འགྱུར་རམ། གསོལ་པ།
en: “Mañjuśrī, if I were in this dwelling speaking with the hearers while you were outside, powerless to enter, would you not suffer?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: “Blessed One, it is not so.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བའི་སླད་དུ་སྟེ།
en: Because all phenomena are included within the realm of phenomena.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་པ་གང་ལགས་པ་འདི་ཡང་ཆོས་ཀྱི་དབྱིངས་ལགས་ཏེ།
en: In this regard, the expression thus-gone one means the realm of phenomena.

source: མཚན་ཉིད་གཅིག་པའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་ཡང་གཞན་ལ་ཆོས་ཀྱི་དབྱིངས་ཀྱང་གཞན་མ་ལགས་སོ།
en: Since they are of a single characteristic, the Thus-Gone One and the realm of phenomena are not any different.

source: །ཆོས་སམ་ཆོས་བསྟན་པ་ཞེས་བགྱི་བའམ། ཆོས་ཉན་པ་ཞེས་བགྱི་བའི་ཆོས་འདི་དག་ཀྱང་གཉིས་སུ་མ་མཆིས་པའི་སླད་དུ་ཐ་དད་པ་མ་མཆིས་ཏེ།
en: Phenomena such as ‘Dharma,’ ‘Dharma teachings,’ or ‘listening to the Dharma’ are nondual and thus are not distinct.

source: དེའི་སླད་དུ་ཡང་ཆོས་ཀྱི་དབྱིངས་ལས་ཐ་དད་པ་མ་ལགས་སོ།
en: And it is for that reason, too, that they are not distinct from the realm of phenomena.

source: །འཇམ་དཔལ་ཞེས་བགྱི་བའི་ཡི་གེ་གང་ལགས་པ་འདི་དག་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སུ་གཏོགས་ཏེ།
en: The syllables that make up the name Mañjuśrī also belong to the realm of phenomena.

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན་བདག་ཆུང་ཟད་ཀྱང་གདུང་བ་མ་མཆིས་ལགས་སོ།
en: Thus, Blessed One, for this reason I would not be distressed in the slightest.

source: །བཅོམ་ལྡན་འདས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཆོས་སྟོན་དུ་ལགས་ཀྱང་བདག་དེར་མཆི་ཡང་མི་མཆི། དེར་མཆིར་དགའ་བའམ། ཡོངས་སུ་གདུང་བ་ཡང་མི་སྐྱེད་ལགས་སོ།
en: Even if the Blessed One were to teach the Dharma for eons equal in number to the grains of sand in the River Ganges, whether I were there or not, I would experience neither joy at being there nor anguish otherwise.

source: བཅོམ་ལྡན་འདས་གཉིས་ཤིག་མཆིས་ན་ནི་དགའ་བའམ།
en: Blessed One, if duality existed then I would experience joy or anguish.

source: ཡོངས་སུ་གདུང་བ་སྐྱེད་པར་འགྱུར་ན་ཆོས་ཀྱི་དབྱིངས་དེ་ནི་གཉིས་སུ་མ་མཆིས་ཏེ། དེའི་སླད་དུ་བདག་དགའ་བའམ། ཡོངས་སུ་གདུང་བར་མི་འགྱུར་ལགས་སོ།
en: However, the realm of phenomena is nondual, and it is for that reason that I would not become joyful or anguished.

source: །བཅོམ་ལྡན་འདས་ཆོས་སྟོན་པ་མཛད་པའི་ཆོས་བསྟན་པ་དེས་ཀྱང་ཆོས་གང་ཡང་སོགས་པའམ། འབྲི་བའམ། འཕེལ་བའམ། འགྲིབ་པར་མི་བགྱིད་དེ།
en: Blessed One, the teachings by which you share the Dharma do not cause any phenomena to accumulate, diminish, increase, or decrease.

source: འདི་ལྟར་ཆོས་བསྟན་པ་དེ་ནི་ཆོས་གང་ཡང་དམིགས་པས་ཉེ་བར་གནས་པ་མ་ལགས་ཏེ།
en: Such a teaching is not founded on apprehending any phenomenon whatsoever.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་ཡང་བདག་དགའ་བར་མི་འགྱུར་ཞིང་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་ལགས་སོ།
en: It is for that reason as well, Blessed One, that I would not become joyous or anguished.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྤོབས་པ་ཐོས་སམ། གསོལ་པ།
en: At this point, the Blessed One asked Venerable Śāriputra, “Did you hear Youthful Mañjuśrī’s eloquence, Śāriputra?”

source: བཅོམ་ལྡན་འདས་ཐོས་ལགས་ཏེ།
en: “Blessed One, I heard.

source: བཅོམ་ལྡན་འདས་བདག་ནི་བཅོམ་ལྡན་འདས་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྤོབས་པ་ཐོས་ཀྱང་ཅི་མ་རུང་སྙམ་སྟེ། དེའི་སླད་དུ་བདག་འདི་ན་མཆིས་ལགས་སོ།
en: I came here, Blessed One, thinking how wonderful it would be to hear the eloquent words of the Blessed One and of Youthful Mañjuśrī.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ནང་དུ་མཆི་བར་མཛད་དུ་གསོལ།
en: Youthful Mañjuśrī then said to the Blessed One, “Blessed One, please invite Venerable Śāriputra to come inside.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་དུ་ཤཱ་རིའི་བུ་ཁྱོད་གནས་ཁང་གི་ནང་དུ་ཤོག་ཅེས་བཀའ་སྩལ་ཏོ།
en: “Enter, Śāriputra,” said the Blessed One to Venerable Śāriputra.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གནས་ཁང་དུ་འོངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Venerable Śāriputra entered, prostrated at the Blessed One’s feet, and sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་དོན་གྱི་དབང་གང་མཐོང་བས་འདིར་འོངས།
en: “Honorable Śāriputra,” said Youthful Mañjuśrī to Venerable Śāriputra, who was seated to the side, “what purpose did you envision for coming here?”

source: སྨྲས་པ། འཇམ་དཔལ་ཁོ་བོ་ནི་ཆོས་ཉན་པར་འདོད་པའི་ཕྱིར་འདིར་འོངས་ཏེ།
en: “I came here, Mañjuśrī, with a longing to hear the Dharma.

source: འདི་ལྟར་གང་ན་བཅོམ་ལྡན་འདས་དང་། སྐྱེས་བུ་དམ་པ་ཁྱོད་ལྟ་བུ་གནས་པ་དེ་ན་བསྟན་པ་ཟབ་མོ་ཡང་དག་པར་ཕུལ་དུ་བྱུང་བ་ཡོད་དེ།
en: Where the Blessed One and sublime beings such as yourself are dwelling, there are profound and exquisite teachings.

source: དེའི་ཕྱིར་ཁོ་བོ་འོངས་སོ།
en: It is because of this that I came.”

source: སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་དེ་ནི་དེ་བཞིན་ཏེ་བསྟན་པ་འདི་ནི་ཟབ་བོ། །སྨྲས་པ།
en: “So it is, Honorable Śāriputra. This teaching is profound.”

source: བཅོམ་ལྡན་འདས་ཉིད་དང་ཐབས་ཅིག་ཏུ་བརྩམས་པའི་ཆོས་བསྟན་པ་དེ་ཇི་ཙམ་དུ་ཟབ།
en: “How profound is this Dharma exposition that you commenced together with the Blessed One?”

source: སྨྲས་པ། དེ་ནི་བཙུན་པ་ཤཱ་རིའི་བུས་རྟོགས་པར་མི་འགྱུར་ཏེ།
en: “It will not be comprehended by Honorable Śāriputra.

source: དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ནི་ཆོས་བསྟན་པ་འདིའི་སྣོད་མ་ཡིན་ནོ།
en: A worthy one whose contaminants have been exhausted is not a vessel for this Dharma teaching.

source: འདི་ལྟར་ཆོས་བསྟན་པ་འདི་ནི་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ལ་ཞུགས་པ་མ་ཡིན། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་ཆོས་ལ་ཞུགས་པ་མ་ཡིན། རང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཞུགས་པ་མ་ཡིན། དེ་བཞིན་གཤེགས་པའི་ཆོས་ལ་ཞུགས་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །འདི་ནི་ཆོས་གང་དམིགས་པའི་ཕྱིར་ཡང་ཞུགས་པ་མ་ཡིན་ནོ།
en: Because this Dharma teaching is not engaged with the properties of ordinary beings, is not engaged with the properties of worthy ones, is not engaged with the properties of solitary buddhas, and is not engaged with the properties of thus-gone ones.

source: །འདི་ནི་གང་དུ་ཞུགས་པའམ་ལྡོག་པ་ཡང་མེད་དེ།
en: It is not engaged with the apprehending any property.

source: ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དབེན་པའི་ཕྱིར་རོ། །སྨྲས་པ།
en: Since all attributes are completely void, it is not engaged with, or disengaged from, anything at all.”

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཅི་ལས་བསམས་ཏེ། དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཆོས་བསྟན་པ་འདིའི་སྣོད་མ་ཡིན་ཞེས་དེ་སྐད་སྨྲ།
en: “Mañjuśrī, what is your rationale for saying that worthy ones whose contaminants are exhausted are not vessels for this teaching?”

source: སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་དགྲ་བཅོམ་པ་ཉིད་ནི། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཟད་པ་ཡིན་ན་དེ་གང་གི་སྣོད་ཡིན་ཞིང་།
en: “Honorable Śāriputra, I thought, ‘If the worthy one’s attachment, aversion, and delusion are exhausted, what kind of vessel is he?

source: དེ་གང་ཇི་ལྟ་བུ་ཞིག་གི་སྣོད་དུ་འགྱུར་སྙམ་སྟེ། དེ་ལས་བསམས་ནས་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། ཆོས་བསྟན་པ་འདིའི་སྣོད་མ་ཡིན་ནོ་ཞེས་ཁོ་བོ་དེ་སྐད་སྨྲའོ། །སྨྲས་པ།
en: What kind of vessel will he become?’ Having considered these questions, I reply that worthy ones whose contaminants are exhausted are not vessels for this teaching.”

source: འཇམ་དཔལ་ཁོ་བོ་ནི་ཆོས་བསྟན་པ་འདིའི་དོན་དུ་གཙུག་ལག་ཁང་ནས་གཙུག་ལག་ཁང་དང་། གནས་ཁང་ནས་གནས་ཁང་དང་། ཕུག་ནས་ཕུག་ཏུ་ཁྱོད་ཚོལ་ཏེ།
en: “Mañjuśrī, for the sake of this teaching I went from monastery to monastery, from dwelling to dwelling, and from hermitage to hermitage in search of you.

source: བདག་གིས་ཁྱོད་ལས་ཟབ་པ་ཟབ་པ་ཡང་དག་པའི་སྤོབས་པ་འདི་ལྟ་བུ་འདི་དག་ཐོས་ཀྱང་ཅི་མ་རུང་སྙམ་སྟེ།
en: I thought of how wonderful it would be to hear such profound and eloquent expositions from you.

source: འཇམ་དཔལ་ཁོ་བོ་ནི་བཅོམ་ལྡན་འདས་དང་། ཁྱོད་ཀྱི་ཆོས་བསྟན་པ་ལ་ཆོག་མི་ཤེས་སོ། །སྨྲས་པ།
en: Mañjuśrī, I am insatiable when it comes to the Blessed One’s teachings or your own.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཆོས་བསྟན་པས་ཆོག་མི་ཤེས་སམ། སྨྲས་པ།
en: “Honorable Śāriputra, you are not sated by Dharma teachings?”

source: ཁོ་བོ་ཆོག་མི་ཤེས་སོ། །སྨྲས་པ།
en: “I am not.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཅི་ཆོས་ཀྱི་དབྱིངས་ཆོས་ཚོལ་བར་བྱེད་དམ། སྨྲས་པ།
en: “Honorable Śāriputra, does the realm of phenomena seek out the Dharma?”

source: འཇམ་དཔལ་མི་བྱེད་དོ། །སྨྲས་པ།
en: “It does not, Mañjuśrī.”

source: ཆོས་ཀྱི་དབྱིངས་ཀྱང་གཞན་ལ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ནི་གཞན་པ་ནི་མ་ཡིན་ན་ཅིའི་ཕྱིར་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཆོས་མཉན་པ་ལ་ཆོག་མི་ཤེས།
en: “Since it is not the case that the realm of phenomena is one distinct thing while Venerable Śāriputra is something other, why is it that Venerable Śāriputra is insatiable in listening to the Dharma?

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why do I say this?

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཆོས་ཀྱི་དབྱིངས་ནི་ཆོས་ཚོལ་བར་མི་བྱེད་པའི་ཕྱིར་རོ།
en: Honorable Śāriputra, it is because the realm of phenomena does not seek the Dharma.

source: །གལ་ཏེ་དེ་ཚོལ་བར་བྱེད་ན་ནི་དེའི་ཕྱིར་དེ་ཆོག་ཤེས་པར་འགྱུར་བ་ཞིག་ན་གང་གི་ཕྱིར་ཚོལ་བར་མི་བྱེད་པ་དེའི་ཕྱིར་ཆོག་མི་ཤེས་སོ། །སྨྲས་པ།
en: If it did seek, then it would be something that could be sated. However, since it does not seek, it is not sated.”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་ཁོ་བོ་ལྟ་བུ་ཆོས་ཉན་པ་དེ་ལྟ་བུ་ཁྱོད་ཀྱིས་ག་ལ་རྙེད། སྨྲས་པ།
en: “Mañjuśrī, apart from the Thus-Gone One, where else will you find someone like me to listen to the Dharma?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཤཱ་རིའི་བུ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བའི་ཆོས་ཅན་ཡིན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that you, Śāriputra, will not enter parinirvāṇa?”

source: །སྨྲས་པ།
en: “Yes, I do.”

source: ཇི་ལྟར་མོས། སྨྲས་པ།
en: “Why do you believe this?”

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་གྲུབ་པས་ན་ཁོ་བོ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བའི་ཆོས་ཅན་ཡིན་ནོ་སྙམ་དུ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: “I believe this thinking that, since no phenomenon is established, I too will not enter parinirvāṇa.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཤི་འཕོ་མེད་པ་དང་། སྐྱེ་བ་མེད་པའི་ཆོས་ཅན་ཡིན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that for you there is no death, transmigration, and rebirth?”

source: ཇི་ལྟར་མོས།
en: “Why do you believe this?”

source: སྨྲས་པ། ཆོས་ཀྱི་དབྱིངས་སུ་གཏོགས་པའི་ཕྱིར་ཏེ། ཆོས་ཀྱི་དབྱིངས་ལ་འཆི་འཕོའམ་སྐྱེ་བ་མེད་པ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: “I believe this because I am included within the realm of phenomena, and in the realm of phenomena death, transmigration, and birth do not exist.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་མི་ཤེས་པ་དང་ལྡན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ། །སྨྲས་པ།
en: “Honorable Śāriputra, do you believe that a worthy one whose contaminants have been exhausted is ignorant?”

source: ཤེས་པ་དང་། མི་ཤེས་པ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་མི་ཤེས་པ་དང་ལྡན་ཏེ་འདི་ལྟར་མི་ཤེས་པ་དང་། ཤེས་པ་ནི་མི་ཟད་པའི་ཆོས་ཅན་ཡིན་པའི་ཕྱིར་དབེན་པ་སྟེ།
en: “Since knowledge and ignorance are equivalent, a worthy one whose contaminants have been exhausted is ignorant. In this way, ignorance and knowledge are inexhaustible, and therefore they are void.

source: དེ་བས་ན་མི་ཤེས་པ་དང་། ཤེས་པར་རྣམ་པར་མི་རྟོགས་པའི་ཕྱིར་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་མི་ཤེས་པ་དང་ལྡན་པར་མོས་སོ། །སྨྲས་པ།
en: That being the case, it is because of not conceptualizing ignorance and consciousness that I believe that a worthy one whose contaminants have been exhausted is ignorant.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། ཤེས་པ་དང་བྲལ་བར་མོས་སམ། སྨྲས་པ།
en: “Honorable Śāriputra, do you believe that worthy ones whose contaminants have been exhausted are devoid of knowledge?”

source: མོས་སོ། །སྨྲས་པ།
en: “Yes, I do.”

source: སྨྲས་པ། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་སྟེ།
en: “All phenomena are devoid of any essence.

source: དེ་བས་ན་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཤེས་པ་དང་བྲལ་བར་མོས་སོ། །སྨྲས་པ།
en: Because of this I believe that worthy ones whose contaminants have been exhausted are devoid of knowledge.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། རྣམ་པར་མ་གྲོལ་བའི་ཆོས་ཅན་དུ་མོས་སམ། སྨྲས་པ།
en: “Honorable Śāriputra, do you believe that worthy ones whose contaminants are exhausted are not liberated?”

source: སྨྲས་པ། ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ཏེ།
en: “I believe this because defilements do not exist.

source: འདི་ལྟར་ཉོན་མོངས་པ་མེད་ན་གང་དག་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་ཏེ།
en: From what is one liberated if defilements do not exist?”

source: དེ་ལྟར་མོས་སོ། །སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that the prior thus-gone ones did not appear and did not enter parinirvāṇa?”

source: སྨྲས་པ། འཇམ་དཔལ་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་ནི་སྐྱེ་བ་མེད་དེ།
en: “In the inconceivable realm, Mañjuśrī, there is no birth.

source: གང་མི་སྐྱེ་བ་དེ་ལ་མི་སྣང་བར་འགྱུར་བའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་ག་ལ་ཡོད་དེ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: Thus, how could what is unborn disappear or pass into parinirvāṇa? That is why I believe it.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་སངས་རྒྱས་ཐམས་ཅད་གཅིག་ཡིན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that all buddhas are one?”

source: སྨྲས་པ། འཇམ་དཔལ་ཆོས་ཀྱི་དབྱིངས་ལ་ནི་ཐ་དད་པ་མེད་པ་དེ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: “Mañjuśrī, it is because there are no distinctions in the realm of phenomena that I believe this.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཡིན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that all buddha fields are a single buddha field?”

source: སྨྲས་པ། འཇམ་དཔལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནི་མི་ཟད་པ་ཉིད་ཀྱི་ཞིང་ཡིན་ཏེ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: “Mañjuśrī, since all buddha fields are the field of the inexhaustible, I believe in this way.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱ་བ་མ་ཡིན་པ་དང་། སྤང་བར་བྱ་བ་མ་ཡིན་པ་དང་། མངོན་སུམ་དུ་བྱ་བ་མ་ཡིན་པ་དང་། བསྒོམ་པར་བྱ་བ་མ་ཡིན་པར་མོས་སམ། སྨྲས་པ། མོས་སོ། །སྨྲས་པ། ཇི་ལྟར་མོས།
en: “Honorable Śāriputra, do you believe that no phenomenon can be known, abandoned, actualized, and cultivated?”

source: སྨྲས་པ།
en: “Yes, I do.” “Why do you believe this?”

source: འཇམ་དཔལ་ངོ་བོ་ཉིད་ཀྱིས་ངོ་བོ་ཉིད་ཡོངས་སུ་མི་ཤེས་པ་དང་། རང་བཞིན་གྱིས་རང་བཞིན་སྤོང་བ་དང་། མངོན་སུམ་དུ་མི་བྱེད་པ་དང་། སྒོམ་པར་མི་བྱེད་པ་དང་། སྐྱེད་པར་མི་བྱེད་པ་དང་། འགག་པར་མི་བྱེད་པ་དང་། ལེན་པར་མི་བྱེད་པ་དང་། འདོར་བར་མི་བྱེད་པ་དང་། མཐའ་དེ་ནི་མི་གནས་པ་ཉིད་དེ།
en: “Essentially, Mañjuśrī, no essence is known. Naturally, no nature is abandoned, actualized, cultivated, produced, ended, adopted, or rejected. That limit is nonabiding.

source: དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: That is what I believe.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཆོས་ཀྱི་དབྱིངས་ནི་ཕུང་པོར་མི་འདུག་པའི་དབྱིངས་ཡིན་པ་དང་། ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པ་མེད་པ་དང་། ཆོས་གང་ཡང་ཕུང་པོར་འདུག་པ་མེད་པར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that the realm of phenomena is a realm without aggregates, that there is no arising or ceasing of any phenomena, and that there are no phenomena whatsoever that are present as aggregates?”

source: འཇམ་དཔལ་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པའམ། ཕུང་པོར་འདུག་པ་དེ་མི་དམིགས་ཏེ་དེ་ལྟར་མོས་སོ། །སྨྲས་པ།
en: “Mañjuśrī, I do not apprehend any phenomena arising, ceasing, or present as aggregates, and so I believe in this way.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཤེས་རབ་གང་ཡིན་པ་དེ་ཆོས་ཀྱི་དབྱིངས་ཡིན་ལ། ཆོས་ཀྱི་དབྱིངས་གང་ཡིན་པ་དེ་ཤེས་རབ་ཡིན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཞེས་བྱ་བའི་མིང་ཡང་ཐོབ་པ་དང་། དེའི་ཕྱིར་ཡང་དགྲ་བཅོམ་པ་ཞེས་བྱ་བར་མོས་སམ། སྨྲས་པ། མོས་སོ།
en: “Honorable Śāriputra, do you believe that insight is the realm of phenomena, and that the realm of phenomena is insight, and that therefore the so-called realm of phenomena is also called a worthy one
